<?php

	/*
		Используя изученные материалы, напишите функцию которая будет реализовывать
		алгоритм сортировки массива по релевантности. То есть, ваша функция имеет
		2 параметра: массив чисел (размерностью N) и число. Нужно отсортировать
		массив так, чтобы сначала шли числа, близкие ко второму аргументу функции.
		Пример: [3, 5, 34, 6] и число 10. Итоговый массив: [6, 5, 3, 34]
	*/
	
	$numbers = array (29, 9, 33, 1, 59, 55, 74, 8, 63, 99);
	foreach ($numbers as $value) print "$value ";
	$n = rand (1, 100);
	echo " - Изначальный массив. $n - Число.</br>";
	
	function weird($numbers, $n) {
		$weird = array();
		foreach($numbers as $value){
			$weird[$value] = abs ($value - $n);
		}
		asort ($weird);
		return array_keys ($weird); // - возвращает все ключи из функции в начальный массив
	}
	
	$numbers = weird($numbers, $n);
	foreach ($numbers as $value) echo "$value ";
	echo " - Отсортированный массив по ближайшему значению.";

?>