<?php

	/*
		Используя изученные материалы, реализуйте функцию аргументом
		которой должна быть строка состоящая из 3 слов (иванов Иван иванович)
		в произвольном регистре, а возвращаемое значение является строка
		где фамилия указана полностью с заглавной буквы, а далее инициалы
		в верхнем регистре, разделенные точкой (Иванов И.И.)
	*/
	
	$fio = 'иваНОВ иВАН иваНОВИЧ';
	echo "Изначальный ввод: $fio.<br/>";
	
	function fiofix($fio) {
		$fio 	= explode(" ", $fio);
		$fio[0] = mb_strtoupper($fio[0]); //mb_** - функции для работы с многобайтовыми строками
		$fio[0] = mb_substr($fio[0], 0, 1) . mb_strtolower(mb_substr($fio[0], 1, strlen($fio[0]))) . " ";
		$fio[1] = mb_substr((mb_strtoupper($fio[1])), 0, 1) . ".";
		$fio[2] = mb_substr((mb_strtoupper($fio[2])), 0, 1) . ".";
		$output = implode($fio);
		return $output;
	}
	
	$fio = fiofix($fio);
	echo "Исправленный ввод: $fio";

?>