<?php 

	/*
		Используя изученные материалы, реализуйте функцию перевода целого положительного числа из 
		десятичной системы счисления в двоичную. Функция имеет 1 аргумент (целое положительное число) 
		и возвращает строку состоящую из 1 и 0. Функцию decbin() и аналогичные использовать запрещено.
	*/

	$dec = 88;
	function dectobin($dec) {
		$bin = '';
		while ($dec != 0) {
			$bin = ($dec % 2) . $bin;
			$dec = (int)($dec / 2);
		}
		return $bin;
}
	$firstbin = dectobin($dec);
	echo "Изначальное десятичное число: $dec </br>Полученное двоичное число: $firstbin</br>";

	/*
		Сделаем проверку через функцию decbin(), которую нельзя использовать в решении задачи.
	*/

	$truebin = decbin($dec);
	echo "</br>Проверка решения через функцию decbin(): $truebin";

?> 