<?php 
	for ($i = 1; $i <= 10; $i++) {
		$numbers = array (
			$i => rand (1, round ((100 / 2), 0, PHP_ROUND_HALF_DOWN)) * 2);
			
			/*
				Получаем только четные числа в массиве :
				
				Функция round округляет число с заданной точностью
				(в данном случае 0 = до целых чисел) ;
			
				Способ округления PHP_ROUND_HALF_DOWN округляет
				полученное значение вниз: 1.5 до 1, или 9.5 до 9 .
			*/
			
		foreach ($numbers as $key => $value) {
			if (!($value % 5 == 0) and !($value % 6 == 0)) {
				print "$key: $value <br/>";
				
			/* 
				Исключаем из вывода числа, кратные 5 и 6 путем
				добавления "!" перед КАЖДОЙ проверкой на кратность .
			*/
			
			}
		}
	}
?> 